Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: མི་དྲན་པ་ཡང་མ་ཡིན་པར་ཐམས་ཅད་དུ་ལྷུན་གྱིས་གྲུབ་ཅིང་རྣམ་པར་མི་རྟོག་པའི་དྲན་པ་དེ་དག་རྗེས་སུ་དྲན་ཏེ།
en: “A buddha is neither mindful nor unmindful; they are always spontaneously present and nonconceptual.

source: དེའི་ཕྱིར་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ཞེས་བྱའོ། །
en: To recollect these modes of mindfulness is therefore known as the recollection of the Buddha.

source: སངས་རྒྱས་ནི་སེམས་ཅན་དང་ཆོས་ལ་ཐ་དད་པའི་འདུ་ཤེས་མི་མངའ་བ་སྟེ།
en: “A buddha does not perceive differences among beings and phenomena.

source: དེ་དག་གི་དྲན་པ་རྗེས་སུ་དྲན་པས་དེའི་ཕྱིར་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ཞེས་བྱའོ། །
en: Because a bodhisattva recollects through these modes of mindfulness, this is therefore known as the recollection of the Buddha.

source: སངས་རྒྱས་ནི་མི་རྟོག་རྣམ་པར་མི་རྟོག །
en: “Buddhas are not conceptual; they are nonconceptual.

source: མི་ལེན་མི་འདོར་མི་འཁོར་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ།
en: They do not accept or reject. They do not cycle in saṃsāra or pass into nirvāṇa.

source: མི་སྐྱེ་མི་འགག་པ་སྟེ།
en: They do not arise or cease.

source: དེ་དག་རྗེས་སུ་དྲན་ནས། དེའི་ཕྱིར་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ཞེས་བྱའོ། །
en: A bodhisattva recollects these points, which is why this is known as the recollection of the Buddha.

source: གཞན་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཆེན་པོ་མངའ་བ།
en: “Furthermore, the blessed buddhas possess a great collection of merit and wisdom.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྤྱོད་ཡུལ་ཅན།
en: They are domains of great love and compassion.

source: སེམས་ཅན་གྱི་ཕུང་པོ་ཆེན་པོའི་སྐྱབས་སུ་གྱུར་པ། མགོན་དུ་གྱུར་པ། སྨན་པ་ཆེན་པོ་ཟུག་རྔུ་འབྱིན་པ།
en: They serve as refuge and protectors for the great mass of beings and are great doctors who alleviate pain.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ། རྟག་ཏུ་ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་བ།
en: They are perpetual domains of samādhi in which all beings are held to be equal.

source: འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ལས་རྣམ་པར་གྲོལ་བ། ཉོན་མོངས་པ་དང་། ཤེས་བྱའི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ།
en: They are free of both saṃsāra and nirvāṇa and have surpassed the obscurations of the afflictive emotions and cognitive obscurations.

source: སེམས་ཅན་ཆེན་པོའི་གནས་སེམས་ཅན་ཆེན་པོའི་རྟེན། རྣམ་པར་འདྲེན་པ། ཆོས་ཀྱི་སྐུ་སྤྱོད་ཡུལ་བ།
en: They are the abode of a great being, the basis of a great being, and a guide.

source: ཐམས་ཅད་དུ་ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་དང་ལྡན་པ། རྟག་ཏུ་སེམས་ཅན་གྱི་དོན་ལ་དགྱེས་པ། སྐུ་དང་། གསུང་དང་།
en: They have the scope of the dharmakāya, are in all circumstances possessed of a mind free of hostility, and are constantly delighted to serve beings.

source: ཐུགས་རྒྱ་ཆེ་བ། ཕྱད་པར་ལུང་སྟོན་པ། སྐུ་དང་། གསུང་དང་། ཐུགས་ཀྱི་ཕྲིན་ལས་ཀྱི་མཐའ་ཁ་ན་མ་ཐོ་བ་མེད་པ།
en: They are vast in body, speech, and mind, teach perpetually, and are irreproachable in their activities of body, speech, and mind.

source: བག་ཆགས་དང་བཅས་པའི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དཀྲུགས་པ། བདུད་དང་ཕྱིར་རྒོལ་བ་ཐམས་ཅད་བཅོམ་པ། རྩོད་པ་མེད་པའི་ཆོས་ཀྱི་མཆོག་དང་ལྡན་པ། རྒྱ་མཚོ་ཐམས་ཅད་པས་ཆེས་ཟབ་པ།
en: They have confounded desire, anger, and dullness along with their habitual patterns, have conquered all māras and adversaries, and possess the supreme and undisputed Dharma.

source: རི་རབ་ཐམས་ཅད་པས་ཆེས་མཐོ་བ། ས་བས་ཆེས་བརྟན་པ། ཆུ་བས་ཆེས་མཉེན་པ། མེ་བས་ཆེས་འབར་བ། རླུང་བས་ཆེས་ཆགས་པ་མེད་པ། ནམ་མཁའ་བས་ཆེས་དྲི་མ་མེད་པ། ཡིད་ཀྱི་འགྲོ་བ་བས་ཆེས་མགྱོགས་པ། ཡིད་བཞིན་གྱི་ནོར་བུ་བས་ཆེས་ཁྱད་པར་དུ་འཕགས་པ།
en: They are of greater depths than all the oceans, of greater height than all sumerus, more stable than the earth, and more supple than water; they blaze hotter than fire; and they are more unencumbered than the wind, more stainless than space, more nimble than the movements of the mind, and more exalted than a wish-fulfilling jewel.

source: ཐམས་ཅད་མཁྱེན་པ། སེམས་ཅན་ཐམས་ཅད་ལ་མཚུངས་པར་སྦྱོར་བ། ཆགས་པ་ཐམས་ཅད་དང་བྲལ་བ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བརྩོན་པའི་རྒྱུན་མ་བཅད་པ།
en: They are omniscient, equally engaged with every being, free of all desire, and unceasing in their efforts to benefit all beings.

source: གཟུགས་ཚད་མེད་པ། སྒྲ་ཚད་མེད་པ། ཡོན་ཏན་ཚད་མེད་པ།
en: Their physical form, sound, and qualities are immeasurable.

source: ཡུལ་ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ། སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པ།
en: They are inconceivable, possess the inconceivable Dharma of the buddhas, and utterly transcend the mind, thought, and mental objects.

source: སེམས་དང་། ཡིད་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཡུལ་ལས་ཡང་དག་པར་འདས་པ། རིག་པ་དང་ཞབས་ཀྱི་སེམས་དང་ལྡན་པ། ལམ་གསུམ་གྱི་སྡིག་པ་རྣམས་ཡང་དག་པར་ཆད་པ།
en: Their minds are rich in knowledge and ethical conduct and they have cut through the evil of the three paths.

source: སྙིང་རྗེ་ཆེན་པོའི་ལྷག་པའི་བསམ་པ་ཅན། སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་བའི་ཡོན་ཏན་ཅན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕ་མ་ལྟ་བུར་གྱུར་པ།
en: They have the exalted intentions that come from great compassion, possess qualities that are shared in common with all beings, and act as if a mother and father to all beings.

source: དགྲ་ཟིན་ལ་སེམས་སྙོམས་པ། སྟེའུ་དང་ཙན་དན་དུ་མཚུངས་པ།
en: To them, friend and foe are regarded equally, and they experience an axe and sandalwood as the same.

source: སེམས་ཅན་ཐ་མ་དང་། འབྲིང་དང་། མཆོག་ཐམས་ཅད་ལ་ཐམས་ཅད་དུ་རྟག་ཏུ་གསལ་བར་བྱེད་པའི་ཆོས་ཅན།
en: They have the character to bring clarity to all beings—inferior, average, and superior—at all times and in every circumstance.

source: ཕ་རོལ་དཔག་པར་དཀའ་བ་སེམས་ཅན་ཆེན་པོ།
en: They are great beings whom others find difficult to fathom.

source: ལོངས་སྤྱོད་ཆེན་པོ། རིག་པ་དང་ཞབས་སུ་ལྡན་པ་ཆེན་པོ། ཆོས་གསུང་བ་ཆེན་པོ། འདུལ་བ་གསུང་བ་ཆེན་པོ།
en: They possess great luxuries, are rich in knowledge and ethical conduct, and are great speakers of the Dharma and Vinaya.

source: སྐྱེས་བུ་ཆེན་པོ། སྐྱེས་བུ་ཆེན་པོའི་མཚན་དང་ལྡན་པ།
en: They are great people who have the marks of a great person.

source: འཇིག་རྟེན་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པ། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་སྣང་བར་གྱུར་པ།
en: They surpass the entire world and serve as a light of the world.

source: རྣལ་འབྱོར་ཆེན་པོ་ལ་རྣལ་འབྱོར་པ། བསམ་གཏན་ཆེན་པོ་སྤྱོད་ཡུལ་བ། རྣམ་པར་གྲོལ་བ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ། བདག་ཉིད་ཆེ་བ།
en: They are yogins of the great yoga, domains of great meditation who possess the wonder of great liberation.

source: སྐྱེ་བོ་ཆེན་པོའི་ཞམ་རིང་བ་དང་ལྡན་པ། སྐྱེ་བོ་ཁྱད་པར་ཅན་གྱི་ཞམ་རིང་བ་དང་ལྡན་པ། ལྟ་བ་དང་། ཉན་པ་དང་། སྟེན་པ་དང་། བསྙེན་བཀུར་བྱེད་པ་མི་ལྡོག་པ།
en: Great beings with a retinue of great and distinguished people, they have not turned away from seeing, listening, relying upon, and serving.

source: བདག་བདེ་བ་ལ་མི་ལྟ་བ། གཞན་གྱི་སྡུག་བསྔལ་ཞི་བར་བྱེད་པ་ལ་དགྱེས་པ། ཆོས་ལ་གཞོལ་བ། ཆོས་ཀྱི་ནོར་ཅན།
en: Indifferent to their own happiness, they take joy in soothing the suffering of others.

source: ཆོས་ཀྱི་ཟས་ཅན། ཆོས་ཀྱི་སྨན་ཅན། ཆོས་ཀྱི་གཏེར་ཅན། ཆོས་ཀྱི་དབང་ཕྱུག །ཆོས་ཀྱི་བདག་པོ། ཆོས་ཀྱི་སྦྱིན་བདག་རྟག་ཏུ་གཏོང་བ་ལ་མངོན་པར་དགྱེས་པ།
en: They are dedicated to the Dharma, are rich in the Dharma, take the Dharma as food, take the Dharma as medicine, possess the treasury of Dharma, and are lords of the Dharma, masters of the Dharma, and give the Dharma freely.

source: རྟག་ཏུ་བག་ཡོད་པ། རྟག་ཏུ་དབེན་པ་ལ་མངོན་པར་དགྱེས་པ།
en: They always delight in renouncing, remain ever vigilant, and always delight in isolation.

source: ཐམས་ཅད་དུ་སྟེགས་དང་། ཟམ་པར་གྱུར་པ། རྒྱལ་པོའི་ལམ་ཆེན་པོ་དང་འདྲ་བ། ཉི་མ་ཆེན་པོ་དང་འདྲ་བ། ཚངས་པ་ཆེན་པོ་འདྲ་བ་དང་།
en: They serve as a ford and causeway in every regard, are like a royal highway or a great sun, and are like the great Brahmā.

source: ཡེ་ཤེས་ཆེན་པོའི་རྡོ་རྗེ་འཆང་བ། ཆོས་ཆེན་པོས་དབུགས་འབྱིན་པ། གཟུགས་ལྟ་བས་མི་ངོམས་པ། མཐོང་བས་མི་ངོམས་པ་སྟེ།
en: They hold the vajra of great wisdom, provide relief through the great Dharma, and have appearances that are never tiring to see and behold.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དེ་ལྟར་རྗེས་སུ་དྲན་ནོ། །
en: This is how bodhisattvas recollect the blessed buddhas.

source: དེ་ལྟར་དེ་དག་རྗེས་སུ་དྲན་པས་དེ་དག་གི་ཡོན་ཏན་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱིར་སྦྱོར་རོ། །དྲན་པ་ཉེ་བར་འཇོག་གོ། །བརྩོན་འགྲུས་བརྩམ་མོ། །
en: Recollecting them in this way, they apply mindfulness in order to perfect their qualities, doing so with sustained diligence.

source: དེའི་ཕྱིར་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ཞེས་བྱ་སྟེ།
en: Therefore, this is known as the recollection of the Buddha.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: “All this is known as a bodhisattva’s application of the mindfulness of recollecting the Buddha.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “What is a bodhisattva’s application of the mindfulness of recollecting the Dharma?

source: གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ནི་ཡོན་ཏན་མཐའ་ཡས་མུ་མེད་པ་སྟེ། དེ་དག་ནི་ཆོས་ལས་སྐྱེས་པ་ཆོས་ཀྱི་བགོ་སྐལ་ལ་སྤྱོད་པ།
en: Bodhisattvas apply the mindfulness of recollecting the Dharma by thinking, ‘The blessed buddhas have infinite, limitless good qualities.

source: ཆོས་ཀྱིས་སྤྲུལ་པ། ཆོས་བདག་པོར་གྱུར་པ། ཆོས་ལས་བྱུང་བ། ཆོས་ཀྱི་སྤྱོད་ཡུལ། ཆོས་ལ་རྟོན་པ།
en: They are born from Dharma, are heirs to the Dharma, emanate through the Dharma, are lords of the Dharma, arise from the Dharma, are within the scope of the Dharma, are the basis of the Dharma, and are perfected through the Dharma.

source: ཆོས་ཀྱིས་གྲུབ་པ་སྟེ། གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་མཚན་དང་དཔེ་བྱད་བཟང་པོ་དེ་དག་ཀྱང་ཆོས་ལས་སྐྱེས་པ། ཆོས་ཀྱིས་རྙེད་པ། ཆོས་ཀྱིས་གྲུབ་པའོ། །
en: The major and minor marks of the blessed buddhas are also born from the Dharma, found through the Dharma, and perfected through the Dharma.

source: གང་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་པོ་དེ་དག་ཀྱང་ཆོས་ལས་སྐྱེས་པ། ཆོས་ཀྱིས་རྙེད་པ།
en: The thus-gone ones’ ten strengths of a thus-gone one and the four kinds of fearlessness are also born from the Dharma, found through the Dharma, and perfected through the Dharma.

source: ཆོས་ཀྱིས་གྲུབ་པའོ། །གང་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་པོ་དེ་དག་ཀྱང་ཆོས་ལས་སྐྱེས་པ།
en: The thus-gone ones’ eighteen unique qualities of a buddha are also born from the Dharma, found through the Dharma, and perfected through the Dharma.

source: ཆོས་ཀྱིས་རྙེད་པ། ཆོས་ཀྱིས་གྲུབ་པའོ། །གང་འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་བདེ་བ་ཡོད་པ་དེ་དག་ཀྱང་ཆོས་ལས་སྐྱེས་པ། ཆོས་ཀྱིས་རྙེད་པ། ཆོས་ཀྱིས་གྲུབ་པའོ། །
en: All the mundane and transmundane happiness that exists is also born from the Dharma, found through the Dharma, and perfected through the Dharma.

source: དེ་ལྟ་བས་ན་བདག་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཚོལ་བས་ཆོས་གཙོ་བོར་བྱའོ། །ཆོས་སྤྱོད་ཡུལ་བ་དང་།
en: Therefore, other than seeking the awakening of buddhahood, the Dharma will be my main focus.

source: ཆོས་ལ་རྟོན་པ་དང་། ཆོས་ལ་གཞོལ་བ་དང་། ཆོས་སྙིང་པོར་བྱེད་པ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་བསྒྲུབ་པར་བྱའོ་སྙམ་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: I will remain in the scope of the Dharma, support the Dharma, be dedicated to the Dharma, take the Dharma as essential, and accomplish all things that are aligned with the Dharma.’

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། ཆོས་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པར་འཇུག་པས་ཆོས་ནི་ཐ་མ་དང་། འབྲིང་དང་། རབ་མཐོང་ནས་འཇུག་པ་མ་ཡིན་ཏེ།
en: “Furthermore, bodhisattvas think, ‘The Dharma applies equally to all beings; thus it does not perceive them as inferior, average, or superior, and then apply to them as such.

source: དེ་ལྟར་བདག་གིས་ཀྱང་ཆོས་དང་འདྲ་བའི་སེམས་སུ་བྱའོ། །
en: I should therefore make my mind like the Dharma.

source: གནས་ནི་ཕྱོགས་སུ་མ་ལྷུང་བས་ཆོས་ནི་ངོ་བོར་ལྟ་ཞིང་འཇུག་པ་མ་ཡིན་ཏེ།
en: The Dharma is impartial, thus it does not perceive or engage with an essence.

source: ཆོས་ནི་དུས་ཆད་པ་མེད་པ་འདི་མཐོང་བ་ལ་དོན་ཡོད་པ་རང་གིས་རིག་པས་ཆོས་ནི་དུས་ལ་ལྟ་ཞིང་འཇུག་པ་མ་ཡིན་ཏེ།
en: The Dharma is timeless, meaningful to behold, and self-evident, thus it has no regard for or concern with time.

source: ཆོས་ནི་མཐོན་དམན་མེད་པས་ཆོས་ནི་རྒྱ་ཆེན་པོ་ལ་འཇུག་པ་མ་ཡིན། དམན་པ་ལ་འཇུག་པ་མ་ཡིན་ཏེ།
en: There is no high and low in the Dharma, thus it is not concerned with what is vast or lowly.

source: དེ་ལྟར་བདག་གིས་ཀྱང་ཆོས་དང་འཐུན་པའི་སེམས་སུ་བྱའོ། །
en: I should therefore make my mind like the Dharma.

source: ཆོས་ནི་མཆོག་དང་ཐ་མ་དང་བྲལ་བས་ཆོས་ནི་རྣམ་པར་དག་པ་ལ་འཇུག་པ་ཡང་མ་ཡིན། ཉམས་པ་ལ་འཇུག་པ་ཡང་མ་ཡིན་ཏེ།
en: The Dharma is neither superior nor inferior, thus it is not concerned with purity or defilement.

source: ཆོས་ནི་ཞིང་དང་ཞིང་མ་ཡིན་པའི་ལྟ་བ་དང་བྲལ་བས་ཆོས་ནི་འཕགས་པ་ལ་འཇུག་པ་ཡང་མ་ཡིན་སོ་སོའི་སྐྱེ་བོ་ལ་འཇུག་པ་ཡང་མ་ཡིན་ཏེ།
en: The Dharma is free of the view of what is and is not a field, thus it is not concerned with either noble beings or ordinary people.

source: ཆོས་ནི་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་འཇུག་པས་ཆོས་ནི་ཉིན་མོ་འཇུག་ལ་མཚན་མོ་མི་འཇུག་པ་མ་ཡིན། མཚན་མོ་འཇུག་ལ་ཉིན་མོ་མི་འཇུག་པ་མ་ཡིན་ཏེ།
en: The Dharma is constantly and uninterruptedly engaged; thus it is not something engaged in during the day but not at night, or at night but not during the day.

source: ཆོས་ནི་གང་ལ་ཡང་ནམ་ཡང་སྡོད་པ་མ་ཡིན་པས་ཆོས་ནི་འདུལ་བའི་དུས་ལས་ཀྱང་མི་འདའ་སྟེ།
en: The Dharma is never present anywhere; thus it is never out of reach at a moment of training.

source: ཆོས་ནི་ཐམས་ཅད་དུ་འདོད་པ་མེད་པས་ཆོས་ནི་སྡང་བ་རྣམས་ལ་ཞེ་འགྲས་པ་ཡང་མེད་དད་པ་རྣམས་ལ་རྗེས་སུ་ཆགས་པ་ཡང་མེད་དེ།
en: The Dharma lacks desire for anything, thus it has no anger toward those who are hostile nor attraction for those with faith.

source: ཆོས་ནི་བྲི་བ་ཡང་མ་ཡིན། གང་བ་ཡང་མ་ཡིན་ཏེ། དཔག་ཏུ་མེད།
en: The Dharma neither diminishes nor increases, but rather is unfathomable and incalculable.

source: གྲངས་མེད་པས་ནམ་མཁའ་ལྟར་འབྲི་བ་ཡང་མ་ཡིན། འཕེལ་བ་ཡང་མ་ཡིན་ཏེ།
en: Like space, it does not contract or expand.

source: ཆོས་ནི་སེམས་ཅན་རྣམས་ཀྱིས་སྲུང་བ་མ་ཡིན་གྱི་ཆོས་ཀྱིས་སེམས་ཅན་རྣམས་སྲུང་བ་སྟེ།
en: The Dharma is not protected by beings, it is the Dharma that protects beings.

source: ཆོས་ནི་སྐྱབས་ཡོངས་སུ་ཚོལ་བ་མ་ཡིན་པས་ཆོས་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་སྐྱབས་ཡིན་ཏེ།
en: The Dharma does not seek refuge, the Dharma is the refuge for all worlds.

source: ཆོས་ནི་ཐོགས་པ་མེད་པའི་མཚན་ཉིད་པས་ཆོས་ནི་གང་ལ་ཡང་ཐོགས་པ་མེད་དེ།
en: The Dharma has the character of being unobstructed, thus it is not obstructed by anything.

source: ཆོས་ནི་བག་ལ་ཉལ་མེད་པས་བག་ལ་ཉལ་ལ་མི་འཇུག་སྟེ།
en: The Dharma lacks latent impressions; thus it is not concerned with latent impressions.

source: ཆོས་ནི་རྟག་ཏུ་རྣམ་པར་མི་རྟོག་པས་ཆོས་ནི་འཁོར་བས་འཇིགས་སྐྲག་པ་ཡང་མ་ཡིན། མྱ་ངན་ལས་འདས་པ་ལ་རྗེས་སུ་ཆགས་པ་ཡང་མ་ཡིན་ཏེ།
en: The Dharma is always nonconceptual, thus it does not fear saṃsāra nor is it attracted to nirvāṇa.

source: དེ་ལྟར་བདག་གིས་ཀྱང་ཆོས་དང་འདྲ་བའི་སེམས་སུ་བྱའོ་སྙམ་མོ། །
en: I should therefore make my mind like the Dharma.’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལ་ཆོས་ལྟར་དྲན་པ་ཉེ་བར་འཇོག་པས་དེའི་ཕྱིར་ཆོས་རྗེས་སུ་དྲན་པ་ཞེས་བྱ་སྟེ།
en: Thus, because bodhisattvas apply the mindfulness of the Dharma in conformity with the Dharma, it is known as recollecting the Dharma.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: “Child of good family, this is a bodhisattva’s application of the mindfulness of recollecting the Dharma.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། དགེ་འདུན་ནི་ཆོས་སྨྲ་བ། ཆོས་སྤྱོད་པ། ཆོས་སེམས་པ། ཆོས་ཀྱི་ཞིང་། ཆོས་འཛིན་པ། ཆོས་ལ་རྟོན་པ། ཆོས་ལ་མཆོད་པ། ཆོས་ཀྱི་བྱ་བ་བྱེད་པ། ཆོས་སྤྱོད་ཡུལ་བ། ཆོས་སྤྱོད་པ་ཕུན་སུམ་ཚོགས་པ། རང་བཞིན་གྱིས་དྲང་བ། རང་བཞིན་གྱིས་དང་བ།
en: “What is a bodhisattva’s application of the mindfulness of recollecting the Saṅgha?

source: སྙིང་རྗེ་བའི་ཆོས་ཅན། སྙིང་རྗེ་དང་ལྡན་པ། རྟག་ཏུ་དབེན་པ་སྤྱོད་ཡུལ་བ། རྟག་ཏུ་ཆོས་ལ་གཞོལ་བ། རྟག་ཏུ་དཀར་པོ་སྤྱོད་པའོ་སྙམ་མོ། །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: A bodhisattva thinks, ‘The saṅgha professes the Dharma, trains in the Dharma, reflects on the Dharma, is a field of Dharma, upholds the Dharma, supports the Dharma, worships the Dharma, performs the activities of the Dharma, is the domain of the Dharma, is perfect in the conduct of the Dharma, is naturally honest, is naturally clear, has the character of compassion, is compassionate, is always in the domain of solitude, is always dedicated to the Dharma, and will always engage in virtuous conduct.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་འདུན་རྣམ་པ་དུ་མར་གསུངས་པ་ནི་འདི་ལྟ་སྟེ། ཀུན་རྫོབ་ཀྱི་དགེ་འདུན་དང་། དོན་དམ་པའི་དགེ་འདུན་དང་། ངོ་ཚ་ཤེས་པའི་དགེ་འདུན་དང་། ངོ་ཚ་མེད་པའི་དགེ་འདུན་དང་། འཕགས་པའི་དགེ་འདུན་དང་། ཅང་ཤེས་ཀྱི་དགེ་འདུན་དང་། ཕྱིར་མི་ལྡོག་པའི་དགེ་འདུན་ནོ་སྙམ་མོ། །
en: “Furthermore, a bodhisattva thinks, ‘The Blessed One spoke of many types of saṅgha: the conventional saṅgha, the ultimate saṅgha, the modest saṅgha, the immodest saṅgha, the noble saṅgha, the exalted saṅgha, and the irreversible saṅgha.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཀུན་རྫོབ་ཀྱི་དགེ་འདུན་བསྡུ་བའི་ཕྱིར་ནན་ཏན་བྱེད་དོ། །དོན་དམ་པའི་དགེ་འདུན་ལ་བསྟེན་པའི་ཕྱིར་ནན་ཏན་བྱེད་དོ། །ངོ་ཚ་ཤེས་པའི་དགེ་འདུན་རྣམ་པར་ཐར་བར་བྱ་བའི་ཕྱིར་ནན་ཏན་བྱེད་དོ། །ངོ་ཚ་མེད་པའི་དགེ་འདུན་ཡོངས་སུ་གདུལ་བའི་ཕྱིར་ནན་ཏན་བྱེད་དོ། །འཕགས་པའི་དགེ་འདུན་ལ་མཆོད་ཅིང་བསྟི་སྟང་བྱ་བའི་ཕྱིར་ནན་ཏན་བྱེད་དོ། །
en: A bodhisattva endeavors in gathering the conventional saṅgha, serving the ultimate saṅgha, liberating the modest saṅgha, taming the immodest saṅgha, and worshiping and venerating the noble saṅgha; endeavors just as the Buddha did with the exalted saṅgha; and endeavors for the sake of Dharma instruction among the irreversible saṅgha.’

source: ཅང་ཤེས་ཀྱི་དགེ་འདུན་ལ་སངས་རྒྱས་བཞིན་དུ་ནན་ཏན་བྱེད་དོ། །ཕྱིར་མི་ལྡོག་པའི་དགེ་འདུན་ལ་ཆོས་ཀྱི་གཏམ་གྱི་ཕྱིར་ནན་ཏན་བྱེད་དོ། །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། རིགས་འཛིན་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་སྲས་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: “Furthermore, a bodhisattva thinks, ‘The saṅgha of a buddha’s heirs upholds the lineage.

source: ཡིད་དུ་འོང་བའི་འབྲས་བུ་རབ་ཏུ་སྦྱིན་པའི་ཕྱིར་ཞིང་བཟང་པོ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of excellent fields yields pleasing fruit.

source: གནས་ངན་ལེན་དང་བྲལ་བའི་ཕྱིར་འཇིགས་པ་མེད་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of the fearless frees from bad rebirths.

source: ཡོངས་སུ་འཛིན་པ་གཏོང་ཞིང་འདོར་བའི་ཕྱིར་སེམས་རྣམ་པར་གྲོལ་བ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of those devoid of the ordinary mind forsakes and casts aside grasping.

source: ཤིན་ཏུ་དུལ་བའི་ཕྱིར་ཅང་ཤེས་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The exalted saṅgha tames intently.

source: མ་འདྲེས་པའི་ཕྱིར་ཉོན་མོངས་པ་མེད་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha that is free of afflictive emotions is uncontaminated.

source: སྡིག་པ་དང་བྲལ་བའི་ཕྱིར་ངོ་ཚ་ཤེས་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of the modest is free of evil.

source: བཀའ་བློ་བདེ་བའི་ཕྱིར་སློབ་མ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of disciples takes pleasure in instruction.

source: བདག་ཡོངས་སུ་ཤེས་པ་དང་ལྡན་པའི་ཕྱིར་བདག་གི་བ་མེད་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha that lacks the notion of “mine” fully understands the self.

source: ཞི་བའི་ཕྱིར་རྒྱགས་པ་མེད་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha devoid of arrogance is peaceful.

source: འདོད་པ་ཉུང་བའི་ཕྱིར་ཕྱིན་ཅི་མ་ལོག་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha that is free of error has few desires.

source: རྣམ་པར་རྟོག་པ་ཡང་དག་པར་ཆད་པའི་ཕྱིར་ནད་མེད་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha free of illness cuts through conceptual thought.

source: ཕ་རོལ་ཏུ་སོན་པའི་ཕྱིར་ཐང་ལ་གནས་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha that remains on level ground has reached the other shore.

source: ཐང་ལ་གནས་པའི་ཕྱིར་བདེ་བ་ཐོབ་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha that has attained happiness remains on level ground.

source: དེ་ཁོ་ན་མཐོང་བའི་ཕྱིར་བག་ཡོད་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of the vigilant sees things as they are.

source: སྐྱོན་མ་ཆགས་པའི་ཕྱིར་དགོན་པ་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of the forest dwellers is not interested in faults.

source: རྒྱ་ཆེ་བའི་ཕྱིར་བྱང་ཆུབ་ལ་གཞོལ་བ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of those dedicated to awakening is vast.

source: བསླབ་པ་གསུམ་གྱི་བྱ་བ་ཤེས་པར་བྱ་བའི་ཕྱིར་བསླབ་པ་འདོད་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of those who seek training knows the ways of the three trainings.

source: དྲན་པ་ཉེ་བར་གཞག་པ་སྤྱོད་ཡུལ་བའི་ཕྱིར་དྲན་པ་དང་ལྡན་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of the mindful falls within the scope of the applications of mindfulness.

source: ཡང་དག་པར་སྤོང་བ་སྤྱོད་ཡུལ་བའི་ཕྱིར་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of those compelled by diligence falls within the scope of correct abandonment.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་སྤྱོད་ཡུལ་བའི་ཕྱིར་ངལ་བ་མེད་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of the unwearied falls within the scope of the bases of miraculous power.

source: དབང་པོ་སྤྱོད་ཡུལ་བའི་ཕྱིར་མི་ཕྱེད་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of the unrelenting falls within the scope of power.

source: སྟོབས་སྤྱོད་ཡུལ་བའི་ཕྱིར་ཚེར་མ་དཀྲུགས་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of the untroubled falls within the scope of strength.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྤྱོད་ཡུལ་བའི་ཕྱིར་བསྒྲིབས་པ་མེད་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of the unobscured falls within the scope of the branches of awakening.

source: ལམ་སྤྱོད་ཡུལ་བའི་ཕྱིར་ཡང་དག་པར་ལྟ་བ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of those with correct view falls within the scope of the path.

source: བདེན་པ་སྤྱོད་ཡུལ་བའི་ཕྱིར་འཕགས་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of noble ones falls within the scope of truth.

source: བསམ་གཏན་སྤྱོད་ཡུལ་བའི་ཕྱིར་མཉམ་པར་གཞག་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha of those with meditative composure falls within the scope of meditative stability.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྤྱོད་ཡུལ་བའི་ཕྱིར་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The saṅgha that turns the wheel of Dharma falls within the scope of dependent arising.

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་ཕྱིར་ཕྱིར་མི་ལྡོག་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ། །
en: The irreversible saṅgha possesses great compassion.

source: བསོད་ནམས་ཐམས་ཅད་ཀྱི་ཚོགས་བསགས་པའི་ཕྱིར་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་རྣམས་ཀྱི་དགེ་འདུན་ནོ་སྙམ་མོ། །
en: And the saṅgha of those with only a single birth remaining has accumulated the requisite of all merit.’

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་དགེ་འདུན་རྗེས་སུ་དྲན་པས་འདི་སྙམ་དུ་སེམས་ཏེ། གང་དགེ་འདུན་གྱི་ཡང་དག་པའི་ཡོན་ཏན་དེ་དག་ནི་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་བསྒྲུབ་པར་བྱའོ་སྙམ་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: A bodhisattva who calls the saṅgha to mind in this way will think, ‘May I and all beings accomplish these perfect qualities of the saṅgha.’ “This is what is known as a bodhisattva’s application of the mindfulness of recollecting the Saṅgha.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s application of the mindfulness of recollecting discipline?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཕུན་སུམ་ཚོགས་པ་གང་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་ཚུལ་ཁྲིམས་ལས་བྱུང་བར་བལྟའོ། །
en: A bodhisattva thinks, ‘I see that all that is excellent and perfect, both mundane and transcendent, arises from discipline.

source: ཚུལ་ཁྲིམས་ནི་ཕུན་སུམ་ཚོགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་གནས་ཡིན་ནོ། །
en: Discipline is the basis for all that is excellent and perfect.

source: འདི་ལྟ་སྟེ་དཔེར་ན། ས་ནི་སྨན་དང་། རྩྭ་དང་། ནགས་ཚལ་ཐམས་ཅད་ཀྱི་གནས་ཡིན་ནོ། །
en: The earth, for example, is the basis for all medicinal plants, grasses, and forests.

source: དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་ཀྱང་ཕུན་སུམ་ཚོགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་གནས་ཡིན་ནོ། །
en: Just so, discipline is the basis for all that is excellent and perfect.

source: བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་གནས་ལ་རབ་ཏུ་གནས་པ་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་སྦྱིན་གནས་ཡིན་ནོ། །
en: Bodhisattvas who maintain a basis of discipline are worthy recipients of worship by the world and its gods.

source: སྦྱིན་པའི་ཆོས་ཡོངས་སུ་རྫོགས་པར་ཡང་བྱེད་དོ། །
en: Doing so also perfects the practice of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་གནས་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དགའ་བ་སྐྱེའོ། །
en: Bodhisattvas who maintain a basis of discipline experience joy.

source: ཡིད་དགའ་བས་འགྱོད་པ་མེད་དོ། །འགྱོད་པ་མེད་པས་མཆོག་ཏུ་དགའ་བ་འཐོབ་བོ། །
en: Joyful in mind, they have no regrets, and without regrets, they attain supreme joy.
